// 1. ctrl + 0, удаляет неиспользуемые импорты
// 2. shift + alt + click - множественные клики
// 3. ctrl + alt + t - обернуть в цикл или условие
// 4. ctrl + shift + v - история буфера обмена
// 5. ctrl + v - выделение через клавиатуру
// 6. ctrl + alt + L - авто форматирование
// 7. ctrl + alt + M - вынес части код в другую функцию
// 8. ctrl + alt + v - вынос кода в переменную локально
// 9. ctrl + alt + F - вынос кода в переменную глобально
// 10. ctr + shift + f - поиск во всем проекте
// 11. ctrl + N - поиск частей кода
// 12. ctrl + g - поиск строчки кода
// 13. ctrl + e - недавно измененные файлы
// 14. ctr + alt + стрелочка влево / вправо -  перемещение по истории курсора
// 15. ctrl + shift + h - просмотр иерархии наследования
// 16. shift + enter - переход на следующую строчку с середины текущей
// 17. ctr + shift + U - перевод всех символов в другой регистр
// 18. alt + insert - генерация кода

